nxp-mcuxpresso/mcux-sdk/boards/mekmimx8qm/driver_examples/isi/mipi_csi2/rgb565/cm4_core1/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MIPI_CSI0_RST_B_GPIO                     MIPI_CSI0__GPIO0   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MIPI_CSI0_RST_B_GPIO_PIN                               0U   /*!< GPIO pin number */
#define BOARD_INITPINS_MIPI_CSI0_RST_B_GPIO_PIN_MASK                  (1U << 0U)   /*!< GPIO pin mask */

/* MIPI_CSI0_GPIO0_01 (number BM22), MIPI_CSI0_EN */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_CSI0_EN_PERIPHERAL                  MIPI_CSI0__GPIO0   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_CSI0_EN_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MIPI_CSI0_EN_CHANNEL                                   01   /*!< Signal channel */
#define BOARD_INITPINS_MIPI_CSI0_EN_PIN_NAME                  MIPI_CSI0_GPIO0_01   /*!< Routed pin name */
#define BOARD_INITPINS_MIPI_CSI0_EN_PIN_FUNCTION_ID      SC_P_MIPI_CSI0_GPIO0_01   /*!< Pin function id */
#define BOARD_INITPINS_MIPI_CSI0_EN_LABEL                         "MIPI_CSI0_EN"   /*!< Label */
#define BOARD_INITPINS_MIPI_CSI0_EN_NAME                          "MIPI_CSI0_EN"   /*!< Identifier */
#define BOARD_INITPINS_MIPI_CSI0_EN_DIRECTION                kGPIO_DigitalOutput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MIPI_CSI0_EN_GPIO                        MIPI_CSI0__GPIO0   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MIPI_CSI0_EN_GPIO_PIN                                  1U   /*!< GPIO pin number */
#define BOARD_INITPINS_MIPI_CSI0_EN_GPIO_PIN_MASK                     (1U << 1U)   /*!< GPIO pin mask */

/* MIPI_CSI0_I2C0_SCL (number BH24), MIPI_CSI0_I2C0_SCL */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SCL_PERIPHERAL             MIPI_CSI0__I2C0   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SCL_SIGNAL                         i2c_scl   /*!< Signal name */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SCL_PIN_NAME            MIPI_CSI0_I2C0_SCL   /*!< Routed pin name */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SCL_PIN_FUNCTION_ID SC_P_MIPI_CSI0_I2C0_SCL  /*!< Pin function id */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SCL_LABEL             "MIPI_CSI0_I2C0_SCL"   /*!< Label */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SCL_NAME              "MIPI_CSI0_I2C0_SCL"   /*!< Identifier */

/* MIPI_CSI0_I2C0_SDA (number BN19), MIPI_CSI0_I2C0_SDA */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SDA_PERIPHERAL             MIPI_CSI0__I2C0   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SDA_SIGNAL                         i2c_sda   /*!< Signal name */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SDA_PIN_NAME            MIPI_CSI0_I2C0_SDA   /*!< Routed pin name */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SDA_PIN_FUNCTION_ID SC_P_MIPI_CSI0_I2C0_SDA  /*!< Pin function id */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SDA_LABEL             "MIPI_CSI0_I2C0_SDA"   /*!< Label */
#define BOARD_INITPINS_MIPI_CSI0_I2C0_SDA_NAME              "MIPI_CSI0_I2C0_SDA"   /*!< Identifier */

/* MIPI_CSI1_MCLK_OUT (number BN23), MIPI_CSI1_MCLK_OUT */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_CSI1_MCLK_OUT_PERIPHERAL              MIPI_CSI1__ACM   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_CSI1_MCLK_OUT_SIGNAL                        mclk_out   /*!< Signal name */
#define BOARD_INITPINS_MIPI_CSI1_MCLK_OUT_PIN_NAME            MIPI_CSI1_MCLK_OUT   /*!< Routed pin name */
#define BOARD_INITPINS_MIPI_CSI1_MCLK_OUT_PIN_FUNCTION_ID SC_P_MIPI_CSI1_MCLK_OUT  /*!< Pin function id */
#define BOARD_INITPINS_MIPI_CSI1_MCLK_OUT_LABEL             "MIPI_CSI1_MCLK_OUT"   /*!< Label */
#define BOARD_INITPINS_MIPI_CSI1_MCLK_OUT_NAME              "MIPI_CSI1_MCLK_OUT"   /*!< Identifier */

/* MIPI_CSI1_GPIO0_00 (number BN15), MIPI_CSI1_RST_B */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_PERIPHERAL               MIPI_CSI1__GPIO0   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_SIGNAL                            gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_CHANNEL                                00   /*!< Signal channel */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_PIN_NAME               MIPI_CSI1_GPIO0_00   /*!< Routed pin name */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_PIN_FUNCTION_ID   SC_P_MIPI_CSI1_GPIO0_00   /*!< Pin function id */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_LABEL                   "MIPI_CSI1_RST_B"   /*!< Label */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_NAME                    "MIPI_CSI1_RST_B"   /*!< Identifier */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_DIRECTION             kGPIO_DigitalOutput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_GPIO                     MIPI_CSI1__GPIO0   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_GPIO_PIN                               0U   /*!< GPIO pin number */
#define BOARD_INITPINS_MIPI_CSI1_RST_B_GPIO_PIN_MASK                  (1U << 0U)   /*!< GPIO pin mask */

/* MIPI_CSI1_GPIO0_01 (number BN13), MIPI_CSI1_EN */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_CSI1_EN_PERIPHERAL                  MIPI_CSI1__GPIO0   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_CSI1_EN_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MIPI_CSI1_EN_CHANNEL                                   01   /*!< Signal channel */
#define BOARD_INITPINS_MIPI_CSI1_EN_PIN_NAME                  MIPI_CSI1_GPIO0_01   /*!< Routed pin name */
#define BOARD_INITPINS_MIPI_CSI1_EN_PIN_FUNCTION_ID      SC_P_MIPI_CSI1_GPIO0_01   /*!< Pin function id */
#define BOARD_INITPINS_MIPI_CSI1_EN_LABEL                         "MIPI_CSI1_EN"   /*!< Label */
#define BOARD_INITPINS_MIPI_CSI1_EN_NAME                          "MIPI_CSI1_EN"   /*!< Identifier */
#define BOARD_INITPINS_MIPI_CSI1_EN_DIRECTION                kGPIO_DigitalOutput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MIPI_CSI1_EN_GPIO                        MIPI_CSI1__GPIO0   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MIPI_CSI1_EN_GPIO_PIN                                  1U   /*!< GPIO pin number */
#define BOARD_INITPINS_MIPI_CSI1_EN_GPIO_PIN_MASK                     (1U << 1U)   /*!< GPIO pin mask */

/* MIPI_CSI1_I2C0_SCL (number BN17), MIPI_CSI1_I2C0_SCL */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SCL_PERIPHERAL             MIPI_CSI1__I2C0   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SCL_SIGNAL                         i2c_scl   /*!< Signal name */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SCL_PIN_NAME            MIPI_CSI1_I2C0_SCL   /*!< Routed pin name */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SCL_PIN_FUNCTION_ID SC_P_MIPI_CSI1_I2C0_SCL  /*!< Pin function id */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SCL_LABEL             "MIPI_CSI1_I2C0_SCL"   /*!< Label */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SCL_NAME              "MIPI_CSI1_I2C0_SCL"   /*!< Identifier */

/* MIPI_CSI1_I2C0_SDA (number BE15), MIPI_CSI1_I2C0_SDA */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SDA_PERIPHERAL             MIPI_CSI1__I2C0   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SDA_SIGNAL                         i2c_sda   /*!< Signal name */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SDA_PIN_NAME            MIPI_CSI1_I2C0_SDA   /*!< Routed pin name */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SDA_PIN_FUNCTION_ID SC_P_MIPI_CSI1_I2C0_SDA  /*!< Pin function id */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SDA_LABEL             "MIPI_CSI1_I2C0_SDA"   /*!< Label */
#define BOARD_INITPINS_MIPI_CSI1_I2C0_SDA_NAME              "MIPI_CSI1_I2C0_SDA"   /*!< Identifier */

/* LVDS0_I2C0_SDA (number BD36), MIPI_DSI0_1_EN */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_DSI0_1_EN_PERIPHERAL                     LSIO__GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_DSI0_1_EN_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MIPI_DSI0_1_EN_CHANNEL                                 07   /*!< Signal channel */
#define BOARD_INITPINS_MIPI_DSI0_1_EN_PIN_NAME                    LVDS0_I2C0_SDA   /*!< Routed pin name */
#define BOARD_INITPINS_MIPI_DSI0_1_EN_PIN_FUNCTION_ID        SC_P_LVDS0_I2C0_SDA   /*!< Pin function id */
#define BOARD_INITPINS_MIPI_DSI0_1_EN_LABEL                     "MIPI_DSI0_1_EN"   /*!< Label */
#define BOARD_INITPINS_MIPI_DSI0_1_EN_NAME                      "MIPI_DSI0_1_EN"   /*!< Identifier */
#define BOARD_INITPINS_MIPI_DSI0_1_EN_DIRECTION              kGPIO_DigitalOutput   /*!< Direction */

